{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "ybelkada/falcon-7b-sharded-bf16",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 256,
  "lora_dropout": 0.2,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 256,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "query_key_value",
    "dense"
  ],
  "task_type": "CAUSAL_LM"
}